import {RegionType} from "@/types/master";

export const REGION_KEYWORDS: Record<RegionType, string[]> = {
    '제주시': [
        '동문시장',
        '용담동 해녀',
        '칠성로',
        '제주목관아',
        '우도'
    ],
    '조천읍': [
        '함덕해수욕장',
        '선흘곶',
        '교래자연휴양림',
        '조천포구',
        '산굼부리'
    ],
    '구좌읍': [
        '성산일출봉',
        '해녀문화',
        '월정리해변',
        '종달리',
        '김녕해수욕장'
    ],
    '성산읍': [
        '성산일출봉',
        '섭지코지',
        '광치기해변',
        '오조리 포구',
        '고성리 원담'
    ],
    '표선면': [
        '표선해비치',
        '성읍민속마을',
        '제주민속촌',
        '표선백사장',
        '가시리마을'
    ],
    '남원읍': [
        '신흥리 방어축제',
        '위미리 해녀',
        '논짓물',
        '동백나무군락',
        '큰엉해안'
    ],
    '서귀포시': [
        '정방폭포',
        '이중섭거리',
        '천지연폭포',
        '서귀포매일올레시장',
        '솔동산문화의거리'
    ],
    '안덕면': [
        '산방산',
        '화순해수욕장',
        '대평리 포구',
        '안덕계곡',
        '창천리 초가마을'
    ],
    '대정읍': [
        '모슬포항',
        '송악산',
        '노랑굴',
        '대정향교',
        '알뜨르비행장'
    ],
    '한경면': [
        '신창풍차해안',
        '용수리 철새도래지',
        '수월봉',
        '자구내포구',
        '낙천리 아홉굿'
    ],
    '한림읍': [
        '협재해수욕장',
        '한림항',
        '금능해수욕장',
        '비양도',
        '금악오름'
    ],
    '애월읍': [
        '애월해안도로',
        '곽지해수욕장',
        '신엄리 테우',
        '하가리 빌레못',
        '봉성리 4.3유적'
    ]
} as const;